--------------------------------------------------------
--  파일이 생성됨 - 목요일-12월-13-2018   
--------------------------------------------------------
--------------------------------------------------------
--  DDL for Table 과목
--------------------------------------------------------

  CREATE TABLE "PROJECTCHECK"."과목" 
   (	"과목코드" CHAR(10), 
	"교과목명" VARCHAR2(30), 
	"지도교수코드" CHAR(10), 
	"교과구분" VARCHAR2(20), 
	"소속학과" CHAR(10), 
	"학년" VARCHAR2(20), 
	"학점" NUMBER(1,0)
   )
REM INSERTING into PROJECTCHECK."과목"
SET DEFINE OFF;
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('330083    ','C#','001       ','전공','33        ','2',3);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('900008    ','컴퓨터활용능력','008       ','교양','90        ',null,2);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('330084    ','C#실습','002       ','전공','33        ','2',3);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('330015    ','DB설계','003       ','전공','33        ','2',3);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('330125    ','VC++','004       ','전공','33        ','2',3);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('330126    ','VC++실습','005       ','전공','33        ','2',3);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('330023    ','데이터통신','006       ','전공','33        ','2',3);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('330124    ','자바응용','007       ','전공','33        ','2',3);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('900093    ','안전교육','010       ','교양','90        ',null,2);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('330001    ','프로그래밍실습','002       ','전공','33        ','1',3);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('900106    ','창의적사고','009       ','교양','90        ',null,2);
Insert into PROJECTCHECK."과목" ("과목코드","교과목명","지도교수코드","교과구분","소속학과","학년","학점") values ('330002    ','캡스톤디자인','002       ','전공','33        ','3',3);
--------------------------------------------------------
--  DDL for Index 과목_PK
--------------------------------------------------------

  CREATE UNIQUE INDEX "PROJECTCHECK"."과목_PK" ON "PROJECTCHECK"."과목" ("과목코드")
--------------------------------------------------------
--  Constraints for Table 과목
--------------------------------------------------------

  ALTER TABLE "PROJECTCHECK"."과목" ADD CONSTRAINT "과목_PK" PRIMARY KEY ("과목코드") ENABLE
  ALTER TABLE "PROJECTCHECK"."과목" MODIFY ("과목코드" NOT NULL ENABLE)
