--------------------------------------------------------
--  파일이 생성됨 - 목요일-12월-13-2018   
--------------------------------------------------------
--------------------------------------------------------
--  DDL for Table 성적
--------------------------------------------------------

  CREATE TABLE "PROJECTCHECK"."성적" 
   (	"학생학번" CHAR(10), 
	"수강코드" CHAR(10), 
	"기록일시" DATE, 
	"출석" VARCHAR2(20), 
	"중간" VARCHAR2(20), 
	"기말" VARCHAR2(20), 
	"과제" VARCHAR2(20), 
	"학점" VARCHAR2(20)
   )
REM INSERTING into PROJECTCHECK."성적"
SET DEFINE OFF;
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1733001   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','20','24','18','B0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1433056   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','29','30','20','A+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1433002   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','26','30','20','A+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1433003   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','16','22','20','C+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1533001   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','6','17','18','D0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1433004   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','18','17','6','D0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633009   ','330023-002',to_date('18/11/30','RR/MM/DD'),'20','25','10','12','A+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633009   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','14','30','20','B0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633009   ','330124-002',to_date('18/11/30','RR/MM/DD'),'20','17','6','9','B+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633009   ','330083-002',to_date('18/11/30','RR/MM/DD'),'20','14','7','11','C0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633009   ','330126-002',to_date('18/11/30','RR/MM/DD'),'20','13','5','15','D+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633009   ','330125-002',to_date('18/11/30','RR/MM/DD'),'20','24','20','8','D0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633009   ','330015-002',to_date('18/11/30','RR/MM/DD'),'20','18','6','9','B0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633009   ','900008-001',to_date('18/11/30','RR/MM/DD'),'20','22','24','6','C+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633031   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','16','30','18','B0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633031   ','330124-002',to_date('18/11/30','RR/MM/DD'),'20','11','20','12','C+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633031   ','330083-002',to_date('18/11/30','RR/MM/DD'),'20','20','5','18','A+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633031   ','330126-002',to_date('18/11/30','RR/MM/DD'),'20','21','15','17','B0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633031   ','330125-002',to_date('18/11/30','RR/MM/DD'),'20','15','18','17','B+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633031   ','330015-002',to_date('18/11/30','RR/MM/DD'),'20','24','13','16','C0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633031   ','900106-001',to_date('18/11/30','RR/MM/DD'),'20','8','10','7','D+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633031   ','900093-003',to_date('18/11/30','RR/MM/DD'),'20','17','5','9','D0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633008   ','330023-002',to_date('18/11/30','RR/MM/DD'),'19','21','20','13','B0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633008   ','330084-002',to_date('18/12/13','RR/MM/DD'),'18','20','30','18','B+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633008   ','330124-002',to_date('18/11/30','RR/MM/DD'),'20','8','14','6','B0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633008   ','330083-002',to_date('18/11/30','RR/MM/DD'),'20','6','27','19','C+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633008   ','330126-002',to_date('18/11/30','RR/MM/DD'),'20','18','22','18','C+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1433005   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','8','5','12','F');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1433006   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','10','23','13','D+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1733004   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','16','18','19','C0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1733022   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','28','21','9','C+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1733033   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','15','9','16','D0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1733006   ','330084-002',to_date('18/12/10','RR/MM/DD'),'20','13','10','12','F');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633008   ','330015-002',to_date('18/12/10','RR/MM/DD'),'20','18','30','20','B+');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633008   ','330125-002',to_date('18/12/10','RR/MM/DD'),'20','22','30','20','A0');
Insert into PROJECTCHECK."성적" ("학생학번","수강코드","기록일시","출석","중간","기말","과제","학점") values ('1633008   ','900008-001',to_date('18/12/10','RR/MM/DD'),'20','28','30','20','A+');
--------------------------------------------------------
--  DDL for Index 성적_PK1
--------------------------------------------------------

  CREATE UNIQUE INDEX "PROJECTCHECK"."성적_PK1" ON "PROJECTCHECK"."성적" ("학생학번", "수강코드")
--------------------------------------------------------
--  Constraints for Table 성적
--------------------------------------------------------

  ALTER TABLE "PROJECTCHECK"."성적" ADD CONSTRAINT "성적_PK" PRIMARY KEY ("학생학번", "수강코드") ENABLE
  ALTER TABLE "PROJECTCHECK"."성적" MODIFY ("수강코드" NOT NULL ENABLE)
  ALTER TABLE "PROJECTCHECK"."성적" MODIFY ("학생학번" NOT NULL ENABLE)
