--------------------------------------------------------
--  파일이 생성됨 - 목요일-12월-13-2018   
--------------------------------------------------------
--------------------------------------------------------
--  DDL for Table 수강
--------------------------------------------------------

  CREATE TABLE "PROJECTCHECK"."수강" 
   (	"수강코드" CHAR(10), 
	"과목코드" CHAR(10), 
	"강의실" VARCHAR2(20), 
	"수강학년" VARCHAR2(20), 
	"수강반" VARCHAR2(20), 
	"요일" VARCHAR2(20), 
	"시작시간" VARCHAR2(20), 
	"마침시간" VARCHAR2(20)
   )
REM INSERTING into PROJECTCHECK."수강"
SET DEFINE OFF;
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330083-002','330083    ','K0404','2','B','수','09:10','12:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330083-001','330083    ','K0404','2','A','월','13:10','16:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330084-002','330084    ','K0524','2','B','금','09:10','12:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330015-002','330015    ','K0405','2','B','월','13:10','16:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330125-002','330125    ','K0524','2','B','목','09:10','12:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330126-002','330126    ','K0407','2','B','화','13:10','16:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330023-002','330023    ','K0407','2','B','목','13:10','16:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330124-002','330124    ','K0405','2','B','화','09:10','12:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330084-001','330084    ','K0524','2','A','금','13:10','16:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330015-001','330015    ','K0405','2','A','수','09:10','12:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('900008-001','900008    ','K0701',null,null,'수','13:10','15:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('900106-001','900106    ','K0801',null,null,'수','13:10','15:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('900093-003','900093    ','온라인',null,null,'금','18:00','20:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330125-001','330125    ','K0524','2','A','목','13:10','16:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330126-001','330126    ','K0407','2','A','화','09:10','12:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330023-001','330023    ','K0407','2','A','목','09:10','12:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330124-001','330124    ','K0405','2','A','화','13:10','16:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330001-002','330001    ','K0524','1','B','화','13:10','16:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330001-001','330001    ','K0524','1','A','화','09:10','12:00');
Insert into PROJECTCHECK."수강" ("수강코드","과목코드","강의실","수강학년","수강반","요일","시작시간","마침시간") values ('330002-002','330002    ','K0407','3','B','월','09:10','12:00');
--------------------------------------------------------
--  DDL for Index 수강_PK
--------------------------------------------------------

  CREATE UNIQUE INDEX "PROJECTCHECK"."수강_PK" ON "PROJECTCHECK"."수강" ("수강코드")
--------------------------------------------------------
--  Constraints for Table 수강
--------------------------------------------------------

  ALTER TABLE "PROJECTCHECK"."수강" ADD CONSTRAINT "수강_PK" PRIMARY KEY ("수강코드") ENABLE
  ALTER TABLE "PROJECTCHECK"."수강" MODIFY ("수강코드" NOT NULL ENABLE)
